/*
  KPKLocalizable.strings
  MacPass

  Created by Michael Starke on 20/12/13.
  Copyright (c) 2013 HicknHack Software GmbH. All rights reserved.
*/

"SET_TITLE" = "Modifier le titre";
"SET_USERNAME" = "Modifier utilisateur";
"SET_PASSWORD" = "Modifier mot de passe";
"SET_NOTES" = "Modifier notes";
"SET_URL" = "Modifier URL";

"DATABASE" = "Base de données";
"EMAIL" = "Courrier électronique";
"GENERAL" = "Général";
"HOMEBANKING" = "Banque";
"INTERNET" = "Internet";
"NETWORK" = "Réseau";
"TRASH" = "Corbeille";
"WINDOWS" = "Windows";

/* Copy */
"KPK_GROUP_COPY_%@" = "%@ copy";
"KPK_ENTRY_COPY_%@" = "%@ copy";

/* Validation Errors */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "Le format du titre de la fenêtre n'est pas valide !";
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "La clé d'attribut n'est pas unique";
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "La séquence de saisie automatique n'est pas valide !";

/* Errors */
"ERROR_CORRUPT_TREE" = "La structure interne du fichier est corrompue !";
"ERROR_INVALID_FIELD_SIZE" = "Taille incorrecte dans le champ. Mauvais mot de passe ?";
"ERROR_INVALID_FIELD_TYPE" = "Champ inconnu. Mauvais mot de passe ?";
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "Version de la base de données non prise en charge";
"ERROR_UNSUPPORTED_CHIPHER" = "Algorithme de chiffrement non pris en charge";
"ERROR_UNKNOWN_FILE_FORMAT" = "Format de fichier inconnu";
"ERROR_HEADER_CORRUPTED" = "En-tête de fichier corrompue";
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "Algorithme de compression non pris en charge";
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "Type de flux aléatoire non pris en charge";
"ERROR_INTEGRITY_CHECK_FAILED" = "L'intégrité de la base de données n'est pas assurée";
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "Mauvais mot de passe et/ou fichier clé";
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "Le fichier XML ne contient pas d'élément KeePassFile";
"ERROR_ROOT_ELEMENT_MISSING" = "Le fichier XML ne contient pas de nœud 'root'";
"ERROR_GROUP_ELEMENT_MISSING" = "Le fichier XML ne contient pas de nœud 'Groupe'";
"ERROR_HEADER_HASH_MISSMATCH" = "Le hash de l'en-tête ne correspond pas. Fichier corrompu";
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = "Le fichier XML ne contient pas d'élément clé";
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "Le fichier clé XML ne contient pas d'élément de données";
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "Impossible de lire les données du fichier clé XML";
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "Le hash de l'en-tête n'est pas bon. Les données peuvent être corrompues !";
